# demo.py
print("hello python")
# python 선언 x 
# 런타임 (실행시간)
# 디자인 타임 (코딩 ~)
# 단일따옴표 , 쌍따옴표를 구분 x
# 변수 괄호 x , 함수 괄호() o 
# ---------------------------문법---------------
# dir() 메모리에 있는 디렉토리 목록
# 리스트 순서가 있는 집합 ex) ["ham", "spam"]
# ******** : 들여쓰기 패턴 중요 *******
# 자료형
# 문자열을 아래와 같이 슬라이싱 할 수 있다.
# 0부터 시작 하고 시작하고 끝부분에서는 자기 번호는 제외
# >>> a= "python"
# >>> a[0]
# 'p'
# >>> a[0:3]
# 'pyt'
# >>> a[:3]
# 'pyt'
# >>> a[-2:]
# - 는 끝에서부터 시작
# 'on'
# >>> a[:]
# 'python'
# color = ["key1":"value1", "key2": "value2"]





